####### Synth scrpit for Pulpino #########
####### Modified by Xugang Cao   ########

###### global settings ######
set DESIGN TOP_ASIC
set clk clk_to_dll_i_pad
set clk_wr0 O_spi_sck_wr0_pad
set clk_rd0 O_spi_sck_rd0_pad
set clk_rd1 O_spi_sck_rd1_pad

set rst reset_n_pad
set rst_dll reset_dll_pad
set S0_dll S0_dll_pad
###### Libraries and technology files ######
# source ./script/hdl_path.tcl
#set_attr hdl_language       sv
set_attr hdl_search_path "./"
set_attr script_search_path ./script
set_attr information_level  9
source ./script/tech_settings.tcl
#set_attribute lef_library   "$tech_lef"


###### Read HDL files ######
include ./script/read_hdl.scr
foreach VERILOG_FILE ${VERILOG_FILES} {
    read_hdl -sv ${VERILOG_FILE}.v
}
 # read_hdl -v2001 ${VERILOG_FILE}.v
set_attribute hdl_track_filename_row_col true /

###### Setup for timing optimization #####
set_attribute max_cpus_per_server 32
set_attribute super_thread_servers {localhost localhost localhost localhost localhost localhost localhost localhost localhost localhost localhost localhost localhost localhost localhost localhost } /
set_attribute tns_opto true /

###### Elaborate design ######

set_attribute hdl_vhdl_assign_width_mismatch true
set_attribute hdl_vhdl_lrm_compliance true

#set_attribute hdl_undriven_signal_value 0
#set_attribute hdl_undriven_output_port_value 0
#set_attribute hdl_unconnected_input_port_value 0

# suspend
elaborate $DESIGN


###### Setting constraints ######
define_clock  -name $clk -period 10000 [find / -port $clk] -domain system
define_clock  -name $clk_wr0 -period 10000 [find / -port $clk_wr0] -domain systemwr
define_clock  -name $clk_rd0 -period 10000 [find / -port $clk_rd0] -domain systemrd0
define_clock  -name $clk_rd1 -period 10000 [find / -port $clk_rd1] -domain systemrd1


set_attribute preserve true [find / -instance *PAD*] 



# suspend
set_attribute clock_setup_uncertainty {300 300} $clk
set_attribute clock_hold_uncertainty  {300 300} $clk
set_attribute clock_setup_uncertainty {400 400} $clk_wr0
set_attribute clock_hold_uncertainty  {400 400} $clk_wr0
set_attribute clock_setup_uncertainty {400 400} $clk_rd0
set_attribute clock_hold_uncertainty  {400 400} $clk_rd0
set_attribute clock_setup_uncertainty {400 400} $clk_rd1
set_attribute clock_hold_uncertainty  {400 400} $clk_rd1

path_disable -from [find  / -port ports_in/$rst] 
path_disable -from [find  / -port ports_in/$rst_dll] 
path_disable -from [find  / -port ports_in/$S0_dll] 


set_attribute avoid true [find / -libcell SDF*] 

####### Input Delay && Output Delay ################
external_delay -input  0   -clock [find / -clock $clk_wr0] -edge_fall [find / -port O_spi_cs_n_wr0_pad  ]
external_delay -output 0   -clock [find / -clock $clk] -edge_rise [find / -port config_req_wr0_pad  ]
##NOT sck trigger
# external_delay -output 5000 -clock [find / -clock $clk_wr0] -edge_rise [find / -port IO_spi_data_wr0_pad*] 

external_delay -input  0   -clock [find / -clock $clk_rd0] -edge_fall [find / -port IO_spi_data_rd0_pad*]
external_delay -input  0   -clock [find / -clock $clk_rd0] -edge_fall [find / -port O_spi_cs_n_rd0_pad  ]
external_delay -input  0   -clock [find / -clock $clk_rd0] -edge_rise [find / -port OE_req_rd0_pad      ]
## level clk trigger
external_delay -output 0   -clock [find / -clock $clk    ] -edge_rise [find / -port IO_spi_data_rd0_pad*]
external_delay -output 0   -clock [find / -clock $clk    ] -edge_rise [find / -port config_req_rd0_pad  ]
external_delay -output 4000   -clock [find / -clock $clk_rd0] -edge_rise [find / -port near_full_rd0_pad   ]

external_delay -input  0   -clock [find / -clock $clk_rd1] -edge_fall [find / -port IO_spi_data_rd1_pad*]
external_delay -input  0   -clock [find / -clock $clk_rd1] -edge_fall [find / -port O_spi_cs_n_rd1_pad  ]
external_delay -input  0   -clock [find / -clock $clk_rd1] -edge_rise [find / -port OE_req_rd1_pad      ]
external_delay -output 0   -clock [find / -clock $clk    ] -edge_rise [find / -port IO_spi_data_rd1_pad*]
external_delay -output 0   -clock [find / -clock $clk    ] -edge_rise [find / -port config_req_rd1_pad  ]
external_delay -output 4000   -clock [find / -clock $clk_rd1] -edge_rise [find / -port near_full_rd1_pad   ]

dc::set_max_delay -from O_spi_cs_n_wr0_pad -to IO_spi_data_wr0_pad* 10000 -comment "my max delay"


####### Output Load #########################
set_attribute external_pin_cap 1000 [find / -port IO_spi_data_wr0_pad* ]
set_attribute external_pin_cap 1000 [find / -port config_req_wr0_pad ]

set_attribute external_pin_cap 1000 [find / -port IO_spi_data_rd0_pad* ]
set_attribute external_pin_cap 1000 [find / -port config_req_rd0_pad ]
set_attribute external_pin_cap 1000 [find / -port near_full_rd0_pad ]

set_attribute external_pin_cap 1000 [find / -port IO_spi_data_rd1_pad* ]
set_attribute external_pin_cap 1000 [find / -port config_req_rd1_pad ]
set_attribute external_pin_cap 1000 [find / -port near_full_rd1_pad ]
set_attribute external_pin_cap 1000 [find / -port DLL_clock_out_pad ]


####### Input Drivern #########################
set_attribute fixed_slew 500 [find / -port $rst]
set_attribute fixed_slew 500 [find / -port $rst_dll]
set_attribute fixed_slew 500 [find / -port $S0_dll]
set_attribute fixed_slew 500 [find / -port DLL_BYPASS_i_pad]
set_attribute fixed_slew 500 [find / -port O_spi_cs_n_wr0_pad]

set_attribute fixed_slew 500 [find / -port IO_spi_data_rd0_pad*]
set_attribute fixed_slew 500 [find / -port O_spi_cs_n_rd0_pad]
set_attribute fixed_slew 500 [find / -port OE_req_rd0_pad]

set_attribute fixed_slew 500 [find / -port IO_spi_data_rd1_pad*]
set_attribute fixed_slew 500 [find / -port O_spi_cs_n_rd1_pad]
set_attribute fixed_slew 500 [find / -port OE_req_rd1_pad]


set_attribute max_fanout 32  [find / -design $DESIGN]
set_attribute max_transition 500 [find / -design $DESIGN]

set_attribute interconnect_mode ple
 
set_attribute ideal_driver true  [find / -port $clk]
set_attribute ideal_driver true  [find / -port $rst]
set_attribute ideal_driver true  [find / -port $rst_dll]
set_attribute ideal_driver true  [find / -port $S0_dll]

set_attribute remove_assigns true

###### Clock gating constraint ######
#set_attribute lp_clock_gating_max_flops 4 /designs/*


####check design 
check_design -all > ./rpt/${DESIGN}.design_check.rpt
report timing -verbose -lint > ./rpt/${DESIGN}.timing_check.rpt
# suspend

###### Synthesis ######

# synthesize -to_generic -effort medium
synthesize -to_mapped -eff high -no_incr
synthesize -incremental


###### define cost group ######
##input to register
define_cost_group -name I2C_clk -design $DESIGN
path_group -from [all_inputs] -to $clk -group I2C_clk
report timing -encounter -full_pin_names -num_paths 100 -cost_group I2C_clk  > ./rpt/I2C_clk.rpt

#register to output
define_cost_group -name C2O_clk -design $DESIGN
path_group -from  $clk -to [all_outputs] -group C2O_clk
report timing -encounter -full_pin_names -num_paths 100 -cost_group C2O_clk  > ./rpt/C2O_clk.rpt

#register to register
define_cost_group -name C2C_clk -design $DESIGN
path_group -from  $clk -to  $clk -group C2C_clk

report timing -encounter -full_pin_names -num_paths 100 -cost_group C2C_clk  > ./rpt/C2C_clk.rpt


###### define cost group ######
##input to register
define_cost_group -name I2C_clk_wr0 -design $DESIGN
path_group -from [all_inputs] -to $clk_wr0 -group I2C_clk_wr0
report timing -encounter -full_pin_names -num_paths 100 -cost_group I2C_clk_wr0  > ./rpt/I2C_clk_wr0.rpt


#register to output
define_cost_group -name C2O_clk_wr0 -design $DESIGN
path_group -from  $clk_wr0 -to [all_outputs] -group C2O_clk_wr0
report timing -encounter -full_pin_names -num_paths 100 -cost_group C2O_clk_wr0  > ./rpt/C2O_clk_wr0.rpt

#register to register
define_cost_group -name C2C_clk_wr0 -design $DESIGN
path_group -from  $clk_wr0 -to  $clk_wr0 -group C2C_clk_wr0

report timing -encounter -full_pin_names -num_paths 100 -cost_group C2C_clk_wr0  > ./rpt/C2C_clk_wr0.rpt




define_cost_group -name I2C_clk_rd0 -design $DESIGN
path_group -from [all_inputs] -to $clk_rd0 -group I2C_clk_rd0
report timing -encounter -full_pin_names -num_paths 100 -cost_group I2C_clk_rd0  > ./rpt/I2C_clk_rd0.rpt


#register to output
define_cost_group -name C2O_clk_rd0 -design $DESIGN
path_group -from  $clk_rd0 -to [all_outputs] -group C2O_clk_rd0
report timing -encounter -full_pin_names -num_paths 100 -cost_group C2O_clk_rd0  > ./rpt/C2O_clk_rd0.rpt

#register to register
define_cost_group -name C2C_clk_rd0 -design $DESIGN
path_group -from  $clk_rd0 -to  $clk_rd0 -group C2C_clk_rd0

report timing -encounter -full_pin_names -num_paths 100 -cost_group C2C_clk_rd0  > ./rpt/C2C_clk_rd0.rpt





define_cost_group -name I2C_clk_rd1 -design $DESIGN
path_group -from [all_inputs] -to $clk_rd1 -group I2C_clk_rd1
report timing -encounter -full_pin_names -num_paths 100 -cost_group I2C_clk_rd1  > ./rpt/I2C_clk_rd1.rpt


#register to output
define_cost_group -name C2O_clk_rd1 -design $DESIGN
path_group -from  $clk_rd1 -to [all_outputs] -group C2O_clk_rd1
report timing -encounter -full_pin_names -num_paths 100 -cost_group C2O_clk_rd1  > ./rpt/C2O_clk_rd1.rpt

#register to register
define_cost_group -name C2C_clk_rd1 -design $DESIGN
path_group -from  $clk_rd1 -to  $clk_rd1 -group C2C_clk_rd1

report timing -encounter -full_pin_names -num_paths 100 -cost_group C2C_clk_rd1  > ./rpt/C2C_clk_rd1.rpt



###### Write files for Encounter ######

write_encounter design -basename ./p+r_enc/${DESIGN}_synth
write_sdf -edge check_edge -setuphold split > ./gate/${DESIGN}.sdf
write -m ${DESIGN} > ./gate/${DESIGN}.v

###### Report power and timing ###### 

report power        > ./rpt/${DESIGN}.power.rpt
report area         > ./rpt/${DESIGN}.area.rpt
report gates        > ./rpt/${DESIGN}.gates.rpt
report design_rules > ./rpt/${DESIGN}.rules.rpt
report clock_gating > ./rpt/${DESIGN}.clkgating.rpt
report summary      > ./rpt/${DESIGN}.summary.rpt
report timing      > ./rpt/${DESIGN}.timing.rpt
#### check design after synth
check_design -all > ./rpt/${DESIGN}.check_post_synth.rpt

report timing -from $clk -to $clk_wr0 > ./rpt/${DESIGN}.timing_clk_to_clk_wr0.rpt
report timing -from $clk_wr0 -to $clk > ./rpt/${DESIGN}.timing_clk_wr0_to_clk.rpt
report timing -from $clk -to $clk_rd0 > ./rpt/${DESIGN}.timing_clk_to_clk_rd0.rpt
report timing -from $clk_rd0 -to $clk > ./rpt/${DESIGN}.timing_clk_rd0_to_clk.rpt
report timing -from $clk -to $clk_rd1 > ./rpt/${DESIGN}.timing_clk_to_clk_rd1.rpt
report timing -from $clk_rd1 -to $clk > ./rpt/${DESIGN}.timing_clk_rd1_to_clk.rpt

report timing -verbose -lint > ./rpt/${DESIGN}.timing_check_post_synth.rpt

report timing -paths [eval [get_attribute paths /designs/TOP_ASIC/timing/exceptions/path_groups/grp_1]] > ./rpt/${DESIGN}.clk_timing_exception_no_effect.rpt
check_design -all > ./rpt/${DESIGN}.design_check_post.rpt

puts "The RUNTIME is [get_attr runtime /] seconds"
#exit
