
#set period(1000M) [expr 1*$MARGIN]
#set period(500M) [expr 2*$MARGIN]
#set period(400M) [expr 2.5*$MARGIN]
set period(320M) [expr 5*$MARGIN]
#set period(200M) [expr 5*$MARGIN]
#set period(320M) 2.046 # MARGIN 0.66

create_clock -period $period(320M) -name clock -waveform [list 0 [expr $period(320M)*0.5]] [get_ports clk]

set_clock_uncertainty -setup 0.15 [all_clocks]
set_clock_uncertainty -hold  0.05 [all_clocks]

set_ideal_network [get_ports clk]
set_dont_touch_network [get_ports clk]
set_ideal_network [get_ports rst_n]
set_dont_touch_network [get_ports rst_n]

set_input_delay  [expr 0.2*$period(320M)] -max -clock clock [filter_collection [all_inputs] "full_name !~clk && full_name !~rst_n "]
set_output_delay [expr 0.2*$period(320M)] -max -clock clock [all_outputs]

set_input_delay  [expr 0.0*$period(320M)] -min -clock clock [filter_collection [all_inputs] "full_name !~clk && full_name !~rst_n "]
set_output_delay [expr 0.0*$period(320M)] -min -clock clock [all_outputs]

set_input_transition -min 0.05 [all_inputs]
set_input_transition -max 0.2  [all_inputs]
#set_driving_cell -library u055lscspmvbdr_108c125_wc -lib_cell BUFM4TM -pin Z [all_inputs]
#set_load [expr 8 * [load_of u055lsclpmvbdr_108c125_wc/BUFM4TM/A]] [all_outputs]
set_load -pin_load -max 0.01 [all_outputs]

set_max_transition 0.3 ${TOP_MODULE}
set_max_fanout 30 ${TOP_MODULE}

set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ADFM0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ADFM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ADHM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AN2M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AN2M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AN3M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AN3M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AN4M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AN4M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO211M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO21M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO21M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO221M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO222M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO22B10M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO22B10M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO22B11M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO22B11M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO22M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO22M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO31M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO32M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AO33M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI211M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI211M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI21B01M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI21B01M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI21B10M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI21B10M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI21B20M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI21B20M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI21M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI21M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI221M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI221M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI222M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI222M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI22B20M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI22B20M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI22M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI22M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI31M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI31M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI32M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI32M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI33M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/AOI33M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/BUFTM0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/BUFTM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/CKBUFM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/CKINVM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/CKXOR2M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/INVM0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/INVM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/LACQM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/LACQRM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/LACQRSM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/LACQSM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/LAM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/LAQM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/LAQRM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/LAQRSM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/LAQSM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/LARM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/LARSM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/LASM1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MAO222M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MAOI2223M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MAOI222M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MAOI22M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MOAI22M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MUX2M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MUX2M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MUX3M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MUX3M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MUX4M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MUX4M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MXB2M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MXB2M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MXB3M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MXB3M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MXB4M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/MXB4M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND2B1M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND2B1M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND2M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND2M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND3B1M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND3B1M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND3M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND3M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND4B1M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND4B1M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND4B2M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND4B2M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND4M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/ND4M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR2B1M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR2B1M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR2M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR2M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR3B1M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR3B1M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR3M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR3M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR4B1M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR4B1M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR4B2M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR4B2M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR4M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/NR4M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OA211M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OA21M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OA21M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OA221M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OA222M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OA22M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OA22M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OA31M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OA32M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OA33M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI211B100M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI211B100M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI211M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI211M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI21B01M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI21B01M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI21B10M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI21B10M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI21B20M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI21B20M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI21M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI21M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI221M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI221M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI222M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI222M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI22B10M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI22B10M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI22B20M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI22B20M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI22M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI22M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI31M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI31M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI32M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI32M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI33M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OAI33M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OR2M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OR2M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OR3M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OR3M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OR4M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OR4M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/OR6M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/XNR2M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/XNR2M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/XNR3M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/XNR3M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/XNR4M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/XOR2M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/XOR2M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/XOR3M0TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/XOR3M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdr_108c125_wc/XOR4M1TM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ADFM0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ADFM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ADHM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AN2M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AN2M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AN3M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AN3M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AN4M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AN4M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO211M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO21M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO21M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO221M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO222M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO22B10M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO22B10M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO22B11M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO22B11M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO22M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO22M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO31M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO32M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AO33M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI211M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI211M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI21B01M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI21B01M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI21B10M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI21B10M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI21B20M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI21B20M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI21M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI21M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI221M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI221M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI222M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI222M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI22B20M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI22B20M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI22M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI22M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI31M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI31M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI32M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI32M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI33M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/AOI33M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/BUFTM0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/BUFTM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/CKBUFM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/CKINVM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/CKXOR2M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/DEL1M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/DEL2M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/DEL3M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/DEL4M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/DFCQM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/DFCQRM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/DFCQRSM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/DFCQSM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/INVM0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/INVM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/LACQM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/LACQRM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/LACQRSM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/LACQSM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/LAM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/LAQM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/LAQRM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/LAQRSM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/LAQSM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/LARM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/LARSM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/LASM1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MAO222M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MAOI2223M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MAOI222M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MAOI22M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MOAI22M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MUX2M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MUX2M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MUX3M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MUX3M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MUX4M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MUX4M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MXB2M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MXB2M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MXB3M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MXB3M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MXB4M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/MXB4M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND2B1M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND2B1M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND2M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND2M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND3B1M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND3B1M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND3M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND3M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND4B1M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND4B1M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND4B2M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND4B2M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND4M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/ND4M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR2B1M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR2B1M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR2M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR2M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR3B1M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR3B1M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR3M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR3M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR4B1M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR4B1M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR4B2M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR4B2M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR4M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/NR4M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OA211M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OA21M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OA21M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OA221M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OA222M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OA22M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OA22M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OA31M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OA32M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OA33M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI211B100M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI211B100M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI211M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI211M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI21B01M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI21B01M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI21B10M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI21B10M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI21B20M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI21B20M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI21M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI21M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI221M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI221M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI222M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI222M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI22B10M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI22B10M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI22B20M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI22B20M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI22M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI22M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI31M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI31M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI32M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI32M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI33M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OAI33M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OR2M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OR2M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OR3M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OR3M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OR4M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OR4M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/OR6M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/XNR2M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/XNR2M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/XNR3M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/XNR3M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/XNR4M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/XOR2M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/XOR2M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/XOR3M0UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/XOR3M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdh_108c125_wc/XOR4M1UM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ADFM0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ADFM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ADHM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AN2M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AN2M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AN3M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AN3M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AN4M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AN4M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO211M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO21M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO21M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO221M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO222M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO22B10M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO22B10M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO22B11M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO22B11M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO22M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO22M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO31M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO32M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AO33M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI211M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI211M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI21B01M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI21B01M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI21B10M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI21B10M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI21B20M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI21B20M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI21M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI21M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI221M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI221M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI222M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI222M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI22B20M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI22B20M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI22M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI22M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI31M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI31M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI32M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI32M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI33M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/AOI33M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/BHDM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/BUFTM0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/BUFTM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/CKBUFM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/CKINVM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/CKXOR2M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/DEL1M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/DEL2M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/DEL3M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/DEL4M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/INVM0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/INVM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/LACQM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/LACQRM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/LACQRSM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/LACQSM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/LAM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/LAQM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/LAQRM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/LAQRSM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/LAQSM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/LARM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/LARSM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/LASM1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MAO222M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MAOI2223M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MAOI222M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MAOI22M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MOAI22M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MUX2M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MUX2M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MUX3M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MUX3M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MUX4M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MUX4M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MXB2M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MXB2M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MXB3M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MXB3M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MXB4M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/MXB4M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND2B1M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND2B1M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND2M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND2M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND3B1M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND3B1M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND3M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND3M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND4B1M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND4B1M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND4B2M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND4B2M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND4M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/ND4M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR2B1M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR2B1M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR2M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR2M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR3B1M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR3B1M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR3M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR3M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR4B1M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR4B1M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR4B2M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR4B2M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR4M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/NR4M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OA211M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OA21M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OA21M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OA221M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OA222M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OA22M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OA22M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OA31M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OA32M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OA33M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI211B100M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI211B100M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI211M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI211M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI21B01M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI21B01M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI21B10M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI21B10M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI21B20M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI21B20M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI21M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI21M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI221M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI221M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI222M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI222M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI22B10M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI22B10M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI22B20M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI22B20M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI22M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI22M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI31M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI31M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI32M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI32M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI33M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OAI33M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OR2M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OR2M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OR3M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OR3M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OR4M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OR4M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/OR6M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/XNR2M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/XNR2M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/XNR3M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/XNR3M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/XNR4M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/XOR2M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/XOR2M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/XOR3M0DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/XOR3M1DM] false
set_dont_use [get_lib_cells u055lsclpmvbdl_108c125_wc/XOR4M1DM] false